IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_clb_logic_config_regs.xml
<module id="CLB_LOGIC_CONFIG_REGS" HW_revision="" description="CLB LOGIC CONFIG Registers">
	<register id="CLB_COUNT_RESET" width="32" page="1" offset="0x2" internal="0" description="Counter Block RESET">
		<bitfield id="SEL_0" description="Count Reset Select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Count Reset Select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Count Reset Select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_MODE_1" width="32" page="1" offset="0x4" internal="0" description="Counter Block MODE_1">
		<bitfield id="SEL_0" description="Counter mode 1 select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Counter mode 1 select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Counter mode 1 select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_MODE_0" width="32" page="1" offset="0x6" internal="0" description="Counter Block MODE_0">
		<bitfield id="SEL_0" description="Counter mode 0 select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Counter mode 0 select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Counter mode 0 select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_COUNT_EVENT" width="32" page="1" offset="0x8" internal="0" description="Counter Block EVENT">
		<bitfield id="SEL_0" description="Counter event select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Counter event select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Counter event select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTRA_IN0" width="32" page="1" offset="0xa" internal="0" description="FSM Extra EXT_IN0">
		<bitfield id="SEL_0" description="FSM extra ext input select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM extra ext input select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM extra ext input select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTERNAL_IN0" width="32" page="1" offset="0xc" internal="0" description="FSM EXT_IN0">
		<bitfield id="SEL_0" description="FSM EXT_IN0 select input for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM EXT_IN0 select input for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM EXT_IN0 select input for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTERNAL_IN1" width="32" page="1" offset="0xe" internal="0" description="FSM_EXT_IN1">
		<bitfield id="SEL_0" description="FSM EXT_IN1 select input for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM EXT_IN1 select input for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM EXT_IN1 select input for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_EXTRA_IN1" width="32" page="1" offset="0x10" internal="0" description="FSM Extra_EXT_IN1">
		<bitfield id="SEL_0" description="FSM extra ext input select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="FSM extra ext input select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="FSM extra ext input select 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN0" width="32" page="1" offset="0x12" internal="0" description="LUT4_0/1/2 IN0 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN1" width="32" page="1" offset="0x14" internal="0" description="LUT4_0/1/2 IN1 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN2" width="32" page="1" offset="0x16" internal="0" description="LUT4_0/1/2 IN2 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_IN3" width="32" page="1" offset="0x18" internal="0" description="LUT4_0/1/2 IN3 input source">
		<bitfield id="SEL_0" description="Select inputs for unit 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="SEL_1" description="Select inputs for unit 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="SEL_2" description="Select inputs for unit 2" begin="14" end="10" width="5" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_LUT_FN1_0" width="32" page="1" offset="0x1c" internal="0" description="LUT function for FSM Unit 1 and Unit 0">
		<bitfield id="FN0" description="FSM LUT output function for unit 0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="FN1" description="FSM LUT output function for unit 1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_LUT_FN2" width="32" page="1" offset="0x1e" internal="0" description="LUT function for FSM Unit 2">
		<bitfield id="FN1" description="FSM LUT output function for unit 2" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_FN1_0" width="32" page="1" offset="0x20" internal="0" description="LUT function for LUT4 block of Unit 1 and 0">
		<bitfield id="FN0" description="LUT4 output function for unit 0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="FN1" description="LUT4 output function for unit 1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_LUT4_FN2" width="32" page="1" offset="0x22" internal="0" description="LUT function for LUT4 block of Unit 2">
		<bitfield id="FN1" description="LUT4 output function for unit 2" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_NEXT_STATE_0" width="32" page="1" offset="0x24" internal="0" description="FSM Next state equations for Unit 0">
		<bitfield id="S0" description="FSM next state function for S0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="S1" description="FSM next state function for S1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_NEXT_STATE_1" width="32" page="1" offset="0x26" internal="0" description="FSM Next state equations for Unit 1">
		<bitfield id="S0" description="FSM next state function for S0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="S1" description="FSM next state function for S1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_FSM_NEXT_STATE_2" width="32" page="1" offset="0x28" internal="0" description="FSM Next state equations for Unit 2">
		<bitfield id="S0" description="FSM next state function for S0" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="S1" description="FSM next state function for S1" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLB_MISC_CONTROL" width="32" page="1" offset="0x2a" internal="0" description="Static controls for Ctr,FSM">
		<bitfield id="COUNT_ADD_SHIFT_0" description="Add/Shift for counter 0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_DIR_0" description="Direction for counter 0" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_EVENT_CTRL_0" description="Event control for counter 0" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_ADD_SHIFT_1" description="Add/Shift for counter 1" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_DIR_1" description="Direction for counter 1" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_EVENT_CTRL_1" description="Event control for counter 1" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_ADD_SHIFT_2" description="Add/Shift for counter 2" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_DIR_2" description="Direction for counter 2" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_EVENT_CTRL_2" description="Event control for counter 2" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_SERIALIZER_0" description="Serializer enable 0" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_SERIALIZER_1" description="Serializer enable 1" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="COUNT_SERIALIZER_2" description="Serializer enable 2" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL0_0" description="FSM extra_sel0 for 0" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL1_0" description="FSM extra_sel1 for 0" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL0_1" description="FSM extra_sel0 for 1" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL1_1" description="FSM extra_sel1 for 1" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL0_2" description="FSM extra_sel0 for 2" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSM_EXTRA_SEL1_2" description="FSM extra_sel1 for 2" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="COUNT0_MATCH1_TAP_EN" description="Match1 Tap Enable for Counter 0" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH1_TAP_EN" description="Match1 Tap Enable for Counter 1" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH1_TAP_EN" description="Match1 Tap Enable for Counter 2" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="COUNT0_MATCH2_TAP_EN" description="Match2 Tap Enable for Counter 0" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="COUNT1_MATCH2_TAP_EN" description="Match2 Tap Enable for Counter 1" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="COUNT2_MATCH2_TAP_EN" description="Match2 Tap Enable for Counter 2" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="COUNT0_LFSR_EN" description="Enable LFSR mode for Counter 0" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="COUNT1_LFSR_EN" description="Enable LFSR mode for Counter 1" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="COUNT2_LFSR_EN" description="Enable LFSR mode for Counter 2" begin="26" end="26" width="1" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_0" width="32" page="1" offset="0x2c" internal="0" description="Inp Sel, LUT fns for Out0">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_1" width="32" page="1" offset="0x2e" internal="0" description="Inp Sel, LUT fns for Out1">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_2" width="32" page="1" offset="0x30" internal="0" description="Inp Sel, LUT fns for Out2">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_3" width="32" page="1" offset="0x32" internal="0" description="Inp Sel, LUT fns for Out3">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_4" width="32" page="1" offset="0x34" internal="0" description="Inp Sel, LUT fns for Out4">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_5" width="32" page="1" offset="0x36" internal="0" description="Inp Sel, LUT fns for Out5">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_6" width="32" page="1" offset="0x38" internal="0" description="Inp Sel, LUT fns for Out6">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_OUTPUT_LUT_7" width="32" page="1" offset="0x3a" internal="0" description="Inp Sel, LUT fns for Out7">
		<bitfield id="IN0" description="Select value for IN0 of output LUT" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="IN1" description="Select value for IN1 of output LUT" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="IN2" description="Select value for IN2 of output LUT" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="FN" description="Output function for output LUT" begin="22" end="15" width="8" rwaccess="RW"/>
	</register>
	<register id="CLB_HLC_EVENT_SEL" width="32" page="1" offset="0x3c" internal="0" description="Event Selector register for the High Level controller">
		<bitfield id="EVENT0_SEL" description="Event Select 0" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="EVENT1_SEL" description="Event Select 1" begin="9" end="5" width="5" rwaccess="RW"/>
		<bitfield id="EVENT2_SEL" description="Event Select 2" begin="14" end="10" width="5" rwaccess="RW"/>
		<bitfield id="EVENT3_SEL" description="Event Select 3" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="ALT_EVENT0_SEL" description="Event Select 3" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT1_SEL" description="Event Select 3" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT2_SEL" description="Event Select 3" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="ALT_EVENT3_SEL" description="Event Select 3" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
</module>
